#+title: Test file for Org-transclusion

This is the first section before the first headline.

* =yank-excluded-properties=

#+begin_src elisp
  (setq yank-excluded-properties
        '(:parent category field follow-link fontified font-lock-face help-echo intangible invisible keymap local-map mouse-face read-only yank-handler))

    (setq yank-excluded-properties
        '(category field follow-link fontified font-lock-face help-echo intangible invisible keymap local-map mouse-face read-only yank-handler))

  (setq org-transclusion-yank-remember-user-excluded-props '(:parent))
#+end_src

#+RESULTS:

#+begin_src elisp
  org-transclusion-yank-excluded-properties
#+end_src

#+RESULTS:
| tc-type | tc-beg-mkr | tc-end-mkr | tc-src-beg-mkr | tc-pair | tc-orig-keyword | wrap-prefix | line-prefix | :parent | front-sticky | rear-nonsticky |


#+begin_src elisp
  yank-excluded-properties
#+end_src

#+RESULTS:
| category | field | follow-link | fontified | font-lock-face | help-echo | intangible | invisible | keymap | local-map | mouse-face | read-only | yank-handler |

